In [ ]:
import pandas as pd

df = pd.read_csv('/content/50_Startups.csv')
df.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [ ]:
df.State.unique()

array(['New York', 'California', 'Florida'], dtype=object)

In [ ]:
dummies = pd.get_dummies(df.State)

dummies.head()

   California  Florida  New York
0           0        0         1
1           1        0         0
2           0        1         0
3           0        0         1
4           0        1         0

In [ ]:
merge = pd.concat([df, dummies], axis = 1)

merge.head()

   R&D Spend  Administration  Marketing Spend  ... California  Florida  New York
0  165349.20       136897.80        471784.10  ...          0        0         1
1  162597.70       151377.59        443898.53  ...          1        0         0
2  153441.51       101145.55        407934.54  ...          0        1         0
3  144372.41       118671.85        383199.62  ...          0        0         1
4  142107.34        91391.77        366168.42  ...          0        1         0

[5 rows x 8 columns]

In [ ]:
final = merge.drop('State', axis = "columns")

final.head()

   R&D Spend  Administration  Marketing Spend  ...  California  Florida  New York
0  165349.20       136897.80        471784.10  ...           0        0         1
1  162597.70       151377.59        443898.53  ...           1        0         0
2  153441.51       101145.55        407934.54  ...           0        1         0
3  144372.41       118671.85        383199.62  ...           0        0         1
4  142107.34        91391.77        366168.42  ...           0        1         0

[5 rows x 7 columns]

In [ ]:
final = final.drop(['New York'], axis = 'columns')

final.head()

   R&D Spend  Administration  Marketing Spend     Profit  California  Florida
0  165349.20       136897.80        471784.10  192261.83           0        0
1  162597.70       151377.59        443898.53  191792.06           1        0
2  153441.51       101145.55        407934.54  191050.39           0        1
3  144372.41       118671.85        383199.62  182901.99           0        0
4  142107.34        91391.77        366168.42  166187.94           0        1

# Label encoding

In [ ]:
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()

In [ ]:
newdf = df

newdf.State = le.fit_transform(newdf.State)
newdf.head()

   R&D Spend  Administration  Marketing Spend  State     Profit
0  165349.20       136897.80        471784.10      2  192261.83
1  162597.70       151377.59        443898.53      0  191792.06
2  153441.51       101145.55        407934.54      1  191050.39
3  144372.41       118671.85        383199.62      2  182901.99
4  142107.34        91391.77        366168.42      1  166187.94

# ONE HOT ENCODER

In [ ]:
from sklearn.preprocessing import OneHotEncoder

from sklearn.compose import ColumnTransformer

ct = ColumnTransformer([('State', OneHotEncoder(), [3])],remainder = 'passthrough')

In [ ]:
newct = ct.fit_transform(df)
newct

data = pd.DataFrame(newct)

data.head()

     0    1    2          3          4          5          6
0  0.0  0.0  1.0  165349.20  136897.80  471784.10  192261.83
1  1.0  0.0  0.0  162597.70  151377.59  443898.53  191792.06
2  0.0  1.0  0.0  153441.51  101145.55  407934.54  191050.39
3  0.0  0.0  1.0  144372.41  118671.85  383199.62  182901.99
4  0.0  1.0  0.0  142107.34   91391.77  366168.42  166187.94